ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/skb/FileDownloadReady_ValidRequest_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:StyretFiloverførselModtagAnmod_I>
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
                    <tsk:TransaktionsID>52ea66ca-4778-4877-b2a2-0b99748eb4f0</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-12-28T11:14:18</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:StyretFiloverførselServiceQName>serviceqname</ns:StyretFiloverførselServiceQName>
            <ns:StyretFiloverførselBeskedQName>beskedqname</ns:StyretFiloverførselBeskedQName>
            <ns:StyretFiloverførselDownloadURL>ftp://localhost:10021/sample.txt</ns:StyretFiloverførselDownloadURL>
            <ns:StyretFiloverførselBrugerNavn>user</ns:StyretFiloverførselBrugerNavn>
            <ns:StyretFiloverførselPassword>pass</ns:StyretFiloverførselPassword>
        </ns:StyretFiloverførselModtagAnmod_I>
    </soapenv:Body>
</soapenv:Envelope>